[[-0.39437521  1.58289671 -0.77598596 ...,  1.01030684 -3.091012
  -3.48789644]
 [-0.3690179  -1.12130582  2.62171936 ..., -0.64955962 -0.88040626
  -1.76457262]
 [ 1.44073844  1.32656372  4.61671829 ...,  3.70795012 -0.10266814
  -1.21523118]
 ..., 
 [ 2.99706841  0.37538669 -1.39561343 ...,  2.22036672  2.27346897
   0.77294844]
 [-4.36791706  1.52825439 -1.56312275 ..., -2.09269691 -3.13139725
   0.31636792]
 [ 2.15804267 -1.78873587 -0.96319735 ...,  1.64147258  0.47105929
  -0.80867302]]
------------------------
node {
  name: "_recv_x_placeholder_0/_7"
  op: "_Recv"
  device: "/job:localhost/replica:0/task:0/device:SYCL:0"
  attr {
    key: "client_terminated"
    value {
      b: false
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:localhost/replica:0/task:0/device:SYCL:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 1
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "edge_12__recv_x_placeholder_0"
    }
  }
  attr {
    key: "tensor_type"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "_recv_w_placeholder_0/_5"
  op: "_Recv"
  device: "/job:localhost/replica:0/task:0/device:SYCL:0"
  attr {
    key: "client_terminated"
    value {
      b: false
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:localhost/replica:0/task:0/device:SYCL:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 1
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "edge_11__recv_w_placeholder_0"
    }
  }
  attr {
    key: "tensor_type"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "add1"
  op: "Add"
  input: "_recv_w_placeholder_0/_5"
  input: "_recv_x_placeholder_0/_7"
  device: "/job:localhost/replica:0/task:0/device:SYCL:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "_recv_z_placeholder_0/_3"
  op: "_Recv"
  device: "/job:localhost/replica:0/task:0/device:SYCL:0"
  attr {
    key: "client_terminated"
    value {
      b: false
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:localhost/replica:0/task:0/device:SYCL:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 1
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "edge_14__recv_z_placeholder_0"
    }
  }
  attr {
    key: "tensor_type"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "_recv_y_placeholder_0/_1"
  op: "_Recv"
  device: "/job:localhost/replica:0/task:0/device:SYCL:0"
  attr {
    key: "client_terminated"
    value {
      b: false
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:localhost/replica:0/task:0/device:SYCL:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 1
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "edge_13__recv_y_placeholder_0"
    }
  }
  attr {
    key: "tensor_type"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "add2"
  op: "Add"
  input: "_recv_y_placeholder_0/_1"
  input: "_recv_z_placeholder_0/_3"
  device: "/job:localhost/replica:0/task:0/device:SYCL:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "res"
  op: "Add"
  input: "add1"
  input: "add2"
  device: "/job:localhost/replica:0/task:0/device:SYCL:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "res/_8"
  op: "_Send"
  input: "res"
  device: "/job:localhost/replica:0/task:0/device:SYCL:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "client_terminated"
    value {
      b: false
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:localhost/replica:0/task:0/device:SYCL:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 1
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "edge_4_res"
    }
  }
}
versions {
  producer: 21
}

node {
  name: "res/_9"
  op: "_Recv"
  device: "/job:localhost/replica:0/task:0/cpu:0"
  attr {
    key: "client_terminated"
    value {
      b: false
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:localhost/replica:0/task:0/device:SYCL:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 1
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "edge_4_res"
    }
  }
  attr {
    key: "tensor_type"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "_send_res_0"
  op: "_Send"
  input: "res/_9"
  device: "/job:localhost/replica:0/task:0/cpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "client_terminated"
    value {
      b: true
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 2243100650890480662
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "res:0"
    }
  }
}
node {
  name: "_recv_z_placeholder_0"
  op: "_Recv"
  device: "/job:localhost/replica:0/task:0/cpu:0"
  attr {
    key: "client_terminated"
    value {
      b: true
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 2243100650890480662
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "z_placeholder:0"
    }
  }
  attr {
    key: "tensor_type"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "_recv_z_placeholder_0/_2"
  op: "_Send"
  input: "_recv_z_placeholder_0"
  device: "/job:localhost/replica:0/task:0/cpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "client_terminated"
    value {
      b: false
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:localhost/replica:0/task:0/device:SYCL:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 1
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "edge_14__recv_z_placeholder_0"
    }
  }
}
node {
  name: "_recv_y_placeholder_0"
  op: "_Recv"
  device: "/job:localhost/replica:0/task:0/cpu:0"
  attr {
    key: "client_terminated"
    value {
      b: true
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 2243100650890480662
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "y_placeholder:0"
    }
  }
  attr {
    key: "tensor_type"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "_recv_y_placeholder_0/_0"
  op: "_Send"
  input: "_recv_y_placeholder_0"
  device: "/job:localhost/replica:0/task:0/cpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "client_terminated"
    value {
      b: false
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:localhost/replica:0/task:0/device:SYCL:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 1
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "edge_13__recv_y_placeholder_0"
    }
  }
}
node {
  name: "_recv_x_placeholder_0"
  op: "_Recv"
  device: "/job:localhost/replica:0/task:0/cpu:0"
  attr {
    key: "client_terminated"
    value {
      b: true
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 2243100650890480662
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "x_placeholder:0"
    }
  }
  attr {
    key: "tensor_type"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "_recv_x_placeholder_0/_6"
  op: "_Send"
  input: "_recv_x_placeholder_0"
  device: "/job:localhost/replica:0/task:0/cpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "client_terminated"
    value {
      b: false
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:localhost/replica:0/task:0/device:SYCL:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 1
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "edge_12__recv_x_placeholder_0"
    }
  }
}
node {
  name: "_recv_w_placeholder_0"
  op: "_Recv"
  device: "/job:localhost/replica:0/task:0/cpu:0"
  attr {
    key: "client_terminated"
    value {
      b: true
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 2243100650890480662
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "w_placeholder:0"
    }
  }
  attr {
    key: "tensor_type"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "_recv_w_placeholder_0/_4"
  op: "_Send"
  input: "_recv_w_placeholder_0"
  device: "/job:localhost/replica:0/task:0/cpu:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "client_terminated"
    value {
      b: false
    }
  }
  attr {
    key: "recv_device"
    value {
      s: "/job:localhost/replica:0/task:0/device:SYCL:0"
    }
  }
  attr {
    key: "send_device"
    value {
      s: "/job:localhost/replica:0/task:0/cpu:0"
    }
  }
  attr {
    key: "send_device_incarnation"
    value {
      i: 1
    }
  }
  attr {
    key: "tensor_name"
    value {
      s: "edge_11__recv_w_placeholder_0"
    }
  }
}
versions {
  producer: 21
}

